src/cf/InformationRegisters/СоответствиеТопиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТопиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Топик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Топики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбменСообщениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОбменСообщениями</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиПодключенияКафка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКафка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСообщенийПрочитать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КафкаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Подключение

Функция НастройкиПодключения() Экспорт  
	
	Настрйоки = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияКафка.Адрес КАК Адрес,
	|	НастройкиПодключенияКафка.Таймаут КАК Таймаут,
	|	НастройкиПодключенияКафка.КоличествоСообщенийПрочитать КАК КоличествоСообщений,
	|	НастройкиПодключенияКафка.ИмяПолучателя КАК ИмяПолучателя
	|ИЗ
	|	Справочник.НастройкиПодключенияКафка КАК НастройкиПодключенияКафка
	|ГДЕ
	|	НастройкиПодключенияКафка.НастройкаПоУмолчанию";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		
		Настрйоки = Новый Структура("Адрес, Таймаут, КоличествоСообщений, ИмяПолучателя");   
		
		ЗаполнитьЗначенияСвойств(Настрйоки, Выборка);
		
	КонецЕсли;
	
	Возврат Настрйоки; 
	
КонецФункции // НастройкиПодключения

Функция КлиентКафка(Тип = "KafkaAdminClient", ТекстОшибки = "") Экспорт 
	
	Клиент = Неопределено;
	
	Если ПодключитьКомпоненту() Тогда
		ИнициализироватьКомпоненту(Клиент, Тип, ТекстОшибки);
	Иначе     
		ТекстОшибки = "Не удалось подключить внешнюю компоненту!";
	КонецЕсли; 
	
	Возврат Клиент;
	
КонецФункции //КлиентРэббит  

#КонецОбласти

#Область СериализацияДаных

Функция СериализоватьОбъект(СсылкаНаОбъект) Экспорт
	
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Сериализатор.ЗаписатьJSON(Запись, СсылкаНаОбъект.ПолучитьОбъект(), НазначениеТипаXML.Явное);
	ТекстСообщения = Запись.Закрыть();	
	
	Возврат ТекстСообщения;
	
КонецФункции // СериализоватьОбъект()

Функция ДесериализоватьОбъект(ТекстСообщения) Экспорт
	
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстСообщения);
	
	Возврат Сериализатор.ПрочитатьJSON(Чтение);
	
КонецФункции

#КонецОбласти

#Область ОбменДанными

Процедура ОтправитьСообщение(Топик, ТекстСообщения, ТекстОшибки = "") Экспорт
	
	Если Топик = Неопределено Тогда
		ТекстОшибки = "Не найден топик объекта";
		Возврат;	
	КонецЕсли;
	
	ПараметрыТопика = ПараметрыТопика(Топик);
	
	НастройкиПодклчения = НастройкиПодключения();
	
	Если НастройкиПодклчения = Неопределено Тогда
		ТекстОшибки = "Не заданы настройки подключения";
		Возврат;
	КонецЕсли;
	
	КлиентОтправитель = КлиентКафка("KafkaProducer", ТекстОшибки);  
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
	 	Возврат;
	КонецЕсли;
	
	Успешно = Ложь;
	НачалоОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	КлиентОтправитель.Initialize(НастройкиПодклчения.Адрес, ПараметрыТопика.Имя, -1);
	ЗаполнитьНастройкиГлобальные(КлиентОтправитель, 1);
	ЗаполнитьНастройкиТопика(КлиентОтправитель);
	
	Если КлиентОтправитель.SetJSONMessageList(ТекстСообщения) Тогда
		
		Если КлиентОтправитель.Produce()  Тогда
			
			Если Не КлиентОтправитель.IsDelivered() Тогда 
				ТекстОшибки = "Ошибка отправки сообщений"; 
			Иначе	     
				Успешно = Истина;
			КонецЕсли;
		
		КонецЕсли;	
	
	КонецЕсли;
	
	КонецОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЛоггированиеОперации(Перечисления.ВидОперации.Отправка, ТекстСообщения, КонецОперации - НачалоОперации, Успешно, ТекстОшибки);
	
	КлиентОтправитель = Неопределено;	

КонецПроцедуры // ОтправитьСообщение()

Процедура ПрочитатьСообщения(Топики, ТекстОшибки = "") Экспорт
	
	Если Топики = Неопределено Или Топики.Количество() = 0 Тогда
		ТекстОшибки = "Не найдены топики";
		Возврат;	
	КонецЕсли;
	
	МассивТопиков = Новый Массив;
	
	Для Каждого ЭлементТопик Из Топики Цикл
		ПараметрыТопика = ПараметрыТопика(ЭлементТопик);
		МассивТопиков.Добавить(ПараметрыТопика.Имя);
	КонецЦикла;
	
	НастройкиПодклчения = НастройкиПодключения();
	
	Если НастройкиПодклчения = Неопределено Тогда
		ТекстОшибки = "Не заданы настройки подключения";
		Возврат;
	КонецЕсли;
	
	Клиент = КлиентКафка("KafkaConsumer");
	
	ЗаполнитьНастройкиГлобальные(Клиент, 2);
	ЗаполнитьНастройкиТопика(Клиент, Ложь);
	
	Если Клиент.Инициализация(НастройкиПодклчения.Адрес, НастройкиПодклчения.ИмяПолучателя) <> Истина Тогда
		ТекстОшибки = Клиент.ErrorDescription;      
		Возврат;
	КонецЕсли;  
	
	Если Не ПолучательПодписаться(Клиент, МассивТопиков, ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	Клиент.EscapeMessageValue = Истина;  //Экранировать сообщение
	Клиент.EscapeMessageKey = Истина;  //Экранировать ключ сообщения   
	Клиент.EscapeMessageHeaderKey = Истина;  //Экранировать ключи загловоков    
	Клиент.EscapeMessageHeaderValue = Истина; //Экранировать значения загловоков
	
	НачалоОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ТекстСообщения = "";
	МассивДанных = Неопределено;
	
	ВызватьПаузу(3000);
	
	Если ПрочитатьСписокСообщенийВПул(Клиент, НастройкиПодклчения.Таймаут, НастройкиПодклчения.КоличествоСообщений, 10, ТекстОшибки) Тогда
		
		ТекстСообщения = ПолучитьСообщенияИзПулаJSON(Клиент,, ТекстОшибки);
	
 		Если ТекстСообщения <> Неопределено Тогда
			
			МассивДанных = JSONВСтруктуру(ТекстСообщения, ТекстОшибки);
			
			Если МассивДанных <> Неопределено Тогда  
				
				Для каждого Строка Из МассивДанных Цикл
				
					ПолученныйОбъект = ДесериализоватьОбъект(Строка.Value);		
					
					Если ПолученныйОбъект.ЭтоНовый() Тогда
						
						МетаОбъекта = ПолученныйОбъект.Метаданные();
						
						Если ОбщегоНазначения.ЭтоСправочник(МетаОбъекта) Тогда
							ПолученныйОбъект.УстановитьНовыйКод("L");	
						ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаОбъекта) Тогда	
							ПолученныйОбъект.УстановитьНовыйНомер("L");	
						КонецЕсли;
						
					КонецЕсли;
					
					ПолученныйОбъект.ОбменДанными.Загрузка = Истина; 
					ПолученныйОбъект.Записать();
					
				КонецЦикла;
				
				Если МассивДанных.Количество() > 0 Тогда
				    ПолучательЗафиксироватьСмещения(Клиент, ТекстОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	КонецОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если МассивДанных <> Неопределено И МассивДанных.Количество() > 0 Тогда
		ЛоггированиеОперации(Перечисления.ВидОперации.Получение, ТекстСообщения, КонецОперации - НачалоОперации, 
			ПустаяСтрока(ТекстОшибки), ТекстОшибки);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТопикОбъекта(СсылкаНаОбъект) Экспорт
	
	Топик = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеТопиков.ИмяОбъекта КАК ИмяОбъекта,
	|	СоответствиеТопиков.Топик КАК Топик
	|ИЗ
	|	РегистрСведений.СоответствиеТопиков КАК СоответствиеТопиков
	|ГДЕ
	|	СоответствиеТопиков.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", СсылкаНаОбъект.Метаданные().ПолноеИмя());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();  
		Топик = Выборка.Топик;
	КонецЕсли;
	
	Возврат Топик;
	
КонецФункции

Процедура ОтправитьТаблицуДанных(ИмяТаблицы, ТекстОшибки = "") Экспорт
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	СтрШаблон("ВЫБРАТЬ
	|	Таб.Ссылка КАК Ссылка
	|ИЗ
	|	%1 КАК Таб", ИмяТаблицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных к отправке");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = КафкаСервер.СериализоватьОбъект(Выборка.Ссылка);
		Заголовки = Новый Массив;  
		МассивДанных.Добавить(Новый Структура("Key, Value, Headers", Строка(Выборка.Ссылка.УникальныйИдентификатор()), ТекстСообщения, Заголовки))
	КонецЦикла;
	
	СообщенияОтправить =  КафкаСервер.СтруктуруВJSON(МассивДанных);
	
	КафкаСервер.ОтправитьСообщение(КафкаСервер.ПолучитьТопикОбъекта(Выборка.Ссылка), СообщенияОтправить, ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Подключение

Функция ПодключитьКомпоненту() 

	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда	
		ИмяМакета = "ОбщийМакет.librdkafka_win32";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ИмяМакета = "ОбщийМакет.librdkafka_win64";
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
	//	ИмяМакета = "ОбщийМакет.librdkafka_linux32";
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда    
	//	ИмяМакета = "ОбщийМакет.librdkafka_linux64";
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не поддерживаемая архитектура платформы'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПодключитьВнешнююКомпоненту(ИмяМакета, "librdkafka", ТипВнешнейКомпоненты.Native);
	
КонецФункции // ПодключитьКомпоненту

Функция ИнициализироватьКомпоненту(Клиент, Тип, ТекстОшибки = "") 
		
	Попытка
		Клиент = Новый("AddIn.librdkafka." + Тип);
		Возврат Истина;
	Исключение   
		Возврат ИнициализироватьКомпонентуАльтернативнымСпособом(Клиент, Тип, ТекстОшибки);
	КонецПопытки;	
	
КонецФункции //ИнициализироватьКомпоненту  

Функция ИнициализироватьКомпонентуАльтернативнымСпособом(Клиент, Тип, ТекстОшибки) 
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда	
		МакетКомпоненты = ПолучитьОбщийМакет("librdkafka_win32");
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		МакетКомпоненты = ПолучитьОбщийМакет("librdkafka_win64");
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
	//	МакетКомпоненты = ПолучитьОбщийМакет("librdkafka_linux32");	
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
	//	МакетКомпоненты = ПолучитьОбщийМакет("librdkafka_linux64");		
	Иначе                   
		ТекстОшибки = "Не поддерживаемая архитектура платформы";
		Возврат Ложь;
	КонецЕсли;
	
    Адрес = ПоместитьВоВременноеХранилище(МакетКомпоненты);
	
    ИмяКомпоненты = "librdkafka";;
	
	Если ПодключитьВнешнююКомпоненту(Адрес, ИмяКомпоненты, ТипВнешнейКомпоненты.Native) Тогда
		Попытка
			Клиент  = Новый("AddIn." + ИмяКомпоненты + "." + Тип);
			Возврат Истина;
		Исключение
			ТекстОшибки = "Не удалось подключить внешнюю компоненту";
			Возврат Ложь;
		КонецПопытки;	
	Иначе 
		ТекстОшибки = "Не удалось подключить внешнюю компоненту";
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции //ИнициализироватьКомпонентуАльтернативнымСпособом  

#КонецОбласти

#Область Инициализация

Процедура ЗаполнитьНастройкиГлобальные(Клиент, ТипКлиента = 0)
	
	Если ТипКлиента = 0 Тогда
		//Клиент администрирования   
		Если Клиент.SetGlobalConf("socket.timeout.ms", "30000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
	ИначеЕсли ТипКлиента = 1 Тогда	
		//Отправитель
		Если Клиент.SetGlobalConf("queue.buffering.max.messages", "1000000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetGlobalConf("socket.timeout.ms", "30000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetGlobalConf("delivery.report.only.error", "false") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
	Иначе	
		//Получатель      
		Если Клиент.SetGlobalConf("message.max.bytes", "10000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetGlobalConf("socket.timeout.ms", "30000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetGlobalConf("enable.auto.commit", "false") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetGlobalConf("auto.commit.interval.ms", "0") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьНастройкиТопика(Клиент, Отправитель = Истина)
	
	Если Отправитель Тогда	
		//Отправитель   
		Если Клиент.SetTopicConf("message.timeout.ms", "30000") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetTopicConf("compression.codec", "lz4") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetTopicConf("request.required.acks", "-1") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
	Иначе	
		//Получатель   
		Если Клиент.SetTopicConf("compression.codec", "lz4") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
		Если Клиент.SetTopicConf("auto.offset.reset", "smallest") <> Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Клиент.ErrorDescription);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция СтруктуруВJSON(СтруктураДанных) Экспорт
	
	ЗаписьJSON                = Новый ЗаписьJSON();
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON();
	
	ЗаписьJSON.УстановитьСтроку();
	
	НастройкиСериализацииJSON.ВариантЗаписиДаты      = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, СтруктураДанных, НастройкиСериализацииJSON);
		Данные = ЗаписьJSON.Закрыть();
	Исключение
		Данные = "";	
	КонецПопытки;
	
	Возврат Данные;   
	
КонецФункции

Функция JSONВСтруктуру(ТекстСообщения, ТекстОшибки = "") Экспорт
		
	Результат = Новый Массив;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	
	Попытка
		
		Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Результат.Добавить(Данные);
		ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда
			Результат = Данные;				
		Иначе   
			ТекстОшибки = "Не верный тип данных!"; 
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;	
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;	 
	
КонецФункции

Функция ОчиститьСписокНазначений(Клиент, ТекстОшибки = "")
	
	Результат = Истина;
	
	Если Клиент.ClearTopicPartitionList() <> Истина Тогда 
		ТекстОшибки = Клиент.ErrorDescription;   
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОчиститьСписокНазначений()

Функция ДобавитьНазначение(Клиент, Топик, Партиция = 0, Смещение = Неопределено, ТекстОшибки = "")

	Результат = Истина;
	
	Если Клиент.AddRecordToTopicPartitionList(Топик, Партиция, Смещение) <> Истина Тогда 
		ТекстОшибки = Клиент.ErrorDescription;   
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции // ДобавитьНазначение()

Функция ПолучательНазначить(Клиент, ТекстОшибки = "") Экспорт
	
	Результат = Истина;
	
	Если Клиент.Assign() <> Истина Тогда 
		ТекстОшибки = Клиент.ErrorDescription;   
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;	 
	
КонецФункции

Функция ПрочитатьСписокСообщенийВПул(Клиент, Таймаут, Количество, КоличествоОшибокПрерывания = 1, ТекстОшибки = "") 
	
	Результат = Истина;
	
	Если Клиент.ConsumePool(Таймаут, Количество, КоличествоОшибокПрерывания) <> 1 Тогда 
		ТекстОшибки = Клиент.ErrorDescription;   
		
		Если (ТекстОшибки <> "Local: Timed out") И (ТекстОшибки <> "Timeout: Local: Timed out")
			И (ТекстОшибки <> "Local queue is full") Тогда
		    Результат = Ложь;
		Иначе
			ТекстОшибки = "";	
		КонецЕсли;
		
	КонецЕсли;
	
	КоличествоПрочитано = Клиент.GetMessagePoolLength();
	
	Возврат Результат;	 
	
КонецФункции

Функция ПолучитьСообщенияИзПулаJSON(Клиент, ЧитатьДвоичныеДанные = Ложь, ТекстОшибки = "") 
	
	Результат = Клиент.ReceiveJSONMessages(ЧитатьДвоичныеДанные);
	
	Если Результат = Неопределено Тогда 
		ТекстОшибки = Клиент.ErrorDescription;   
	КонецЕсли;
	
	Если Клиент.ClearMessagePool() <> Истина Тогда
		ТекстОшибки = Клиент.ErrorDescription;
	КонецЕсли;
	
	Возврат Результат;	 
	
КонецФункции

Функция ПолучательПодписаться(Клиент, Топики, ТекстОшибки = "")

	Если Клиент.ClearSubscribeList() <> Истина Тогда 
		ТекстОшибки = "Ошибка очистки списка топиков: " + Клиент.ErrorDescription;   
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ЗначениеТопик Из Топики Цикл 
		Если Клиент.AddTopicToSubscribeList(ЗначениеТопик) <> Истина Тогда
			ТекстОшибки = "Ошибка добавления топика в список: " + Клиент.ErrorDescription;	
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	Если Клиент.Subscribe() <> Истина Тогда
		ТекстОшибки = "Ошибка подписания на топики: " + Клиент.ErrorDescription;	
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;	

КонецФункции // ДобавитьНазначение()

Функция ПолучательЗафиксироватьСмещения(Клиент, ТекстОшибки = "") 
	
	Результат = Истина;
	
	Если Клиент.Commit() <> Истина Тогда 
		ТекстОшибки = Клиент.ErrorDescription;
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФУнкции

Функция ЛоггированиеОперации(Операция, ТекстСообщения, ВремяВыполнения, Успешно = Истина, ТекстОшибки = "")

	МенеджерЗаписи = РегистрыСведений.ОбменСообщениями.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Операция = Операция;
	МенеджерЗаписи.ТекстСообщения = ТекстСообщения;
	МенеджерЗаписи.ВремяВыполнения = ВремяВыполнения;
    МенеджерЗаписи.Успешно = Успешно;  
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;  
	МенеджерЗаписи.Записать(Истина);
	
КонецФункции // ЛоггированиеОперации()

Функция ПараметрыТопика(Топик)
	
	Настрйоки = Неопределено;

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", Топик);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Топики.Наименование КАК Имя,
	|	Топики.Ссылка КАК Топик
	|ИЗ
	|	Справочник.Топики КАК Топики
	|ГДЕ
	|	Топики.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		
		Настрйоки = Новый Структура("Топик, Имя");   
		
		ЗаполнитьЗначенияСвойств(Настрйоки, Выборка);
		
	КонецЕсли;
	
	Возврат Настрйоки;	
	
КонецФункции

#КонецОбласти

#КонецОбласти
